app/controllers/cpanel/categories_controller.rb

SELECT `categories`.name,`categories`.slug,`categories`.created_at,`categories`.updated_at,`categories`.posts_count,`categories`.id FROM `categories` WHERE `categories`.id IN ('1')
---
  def index
    @categories = Category.all