app/controllers/cpanel/comments_controller.rb

SELECT `comments`.status,`comments`.body,`comments`.post_id,`comments`.author,`comments`.url,`comments`.id,`comments`.user_agent,`comments`.user_ip,`comments`.created_at,`comments`.email FROM `comments` ORDER BY id desc, id ASC LIMIT 0, 8
---
  def index
    @comments = Comment.paginate(:page => params[:page],:per_page => 8, :order => 'id desc')