app/controllers/cpanel/home_controller.rb

SELECT count(*) AS count_all FROM `posts` WHERE (status = 1)
SELECT count(*) AS count_all FROM `pages`
SELECT count(*) AS count_all FROM `comments` WHERE (status = 1)
SELECT `posts`.id FROM `posts` WHERE (status = 1) ORDER BY id desc LIMIT 0, 5
SELECT `comments`.id FROM `comments` WHERE (status = 1) ORDER BY id desc, id ASC LIMIT 0, 5
---
  def index
    @total = {}
    @total[:post_count] = Post.count
    @total[:page_count] = Page.count
    @total[:comment_count] = Comment.count

    @recent_posts = Post.limit(5)
    @recent_comments = Comment.recents.all(:include => [:post], :limit => 5)