app/controllers/cpanel/menus_controller.rb

  def index
    @menus = Menu.all
---
SELECT `menus`.name,`menus`.url,`menus`.sort,`menus`.created_at,`menus`.updated_at,`menus`.new_window,`menus`.id FROM `menus` WHERE `menus`.id IN ('1','2','3','4')

  def edit
    @menu = Menu.find(params[:id])
---
SELECT `menus`.name,`menus`.url,`menus`.sort,`menus`.created_at,`menus`.updated_at,`menus`.new_window,`menus`.id FROM `menus` WHERE `menus`.id IN ('5')

  def update
    @menu = Menu.find(params[:id])
---
SELECT `menus`.name,`menus`.url,`menus`.sort,`menus`.created_at,`menus`.updated_at,`menus`.new_window,`menus`.id FROM `menus` WHERE `menus`.id IN ('5')