app/controllers/cpanel/pages_controller.rb

SELECT `pages`.title,`pages`.slug,`pages`.body,`pages`.status,`pages`.created_at,`pages`.updated_at,`pages`.id FROM `pages` WHERE `pages`.id IN ('1','2')
---
  def index
    @pages = Page.paginate :page => params[:page], :per_page => 20, :order => 'id desc'

SELECT `pages`.title,`pages`.slug,`pages`.body,`pages`.status,`pages`.created_at,`pages`.updated_at,`pages`.id FROM `pages` WHERE `pages`.id IN ('3')
---
  def edit
    @page = Page.find(params[:id])

SELECT `pages`.title,`pages`.slug,`pages`.body,`pages`.status,`pages`.created_at,`pages`.updated_at,`pages`.id FROM `pages` WHERE `pages`.id IN ('3')
---
  def update
    @page = Page.find(params[:id])