app/controllers/cpanel/posts_controller.rb

SELECT `categories`.name,`categories`.slug,`categories`.created_at,`categories`.updated_at,`categories`.posts_count,`categories`.id FROM `categories` WHERE `categories`.id IN ('1')
SELECT `posts`.* FROM `posts` INNER JOIN `categories` ON `categories`.id = `posts`.category_id ORDER BY id desc LIMIT 0, 20
---
  def index
    @posts = Post.paginate(:page => params[:page], :include => [:category])

SELECT `posts`.status,`posts`.slug,`posts`.body,`posts`.title,`posts`.meta_keywords,`posts`.id,`posts`.category_id,`posts`.meta_description FROM `posts` WHERE (`posts`.`id` = 7) ORDER BY id desc
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO `posts` (`status`, `slug`, `updated_at`, `body`, `title`, `meta_keywords`, `comment_count`, `category_id`, `meta_description`, `view_count`, `created_at`) VALUES(1, 'pasite-opensource', '2010-02-06 04:05:39', '<p><a href=\"http://pasite.org/\" target=\"_blank\">pasite</a> 是<a href=\"http://huacnlee.com/blog/pasite-release\" target=\"_blank\">半年前</a>我练习 Rails 时做的一个项目，当时因为之前一直在用的 pastie.org 因为贴了绿-坝的分析结果而被block了 ，后面一直没有解冻，我需要用的时候有没有，于是就做了一个仿版。</p>\r\n<p>这个项目是 Ruby on Rails + Python 结合的功能，代码高亮是使用Python的<a href=\"http://pygments.org/\" target=\"_blank\">Pygments</a>，可能不太好直接下载运行，我会慢慢的发安装方式写在 Github 的 Wiki&nbsp; 上面。</p>\r\n<ul>\r\n<li>网址：<a href=\"http://pasite.org/\" target=\"_blank\">http://pasite.org</a></li>\r\n<li>Github：<a href=\"http://github.com/huacnlee/pasite\" target=\"_blank\">http://github.com/huacnlee/pasite</a></li>\r\n</ul>\r\n<p><br /><span style=\"color: #339966;\">这个是我用 Rails 的第二个项目，现在回头看好些地方的写法都不是很好，慢慢修正，大家别见怪！</span></p>\r\n<p><span style=\"color: #000000;\"></span>如果你想加入你的代码，可以直接在Github的项目页面上 <a href=\"http://github.com/huacnlee/pasite/fork\" target=\"_blank\">Fork</a> ,然后下载开始修改，然后在提交。</p>', 'Pasite 源代码开放', '', 0, 1, '', 0, '2010-02-06 04:05:39')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT `posts`.id FROM `posts` WHERE (`posts`.`id` = 8) ORDER BY id desc
---
  def update
    @post = Post.find(params[:id])