app/controllers/cpanel/settings_controller.rb

SELECT `settings`.created_at,`settings`.updated_at,`settings`.id FROM `settings` WHERE `settings`.id IN ('1')
---
  def index
    @setting = Setting.find_create

SELECT `settings`.id FROM `settings` WHERE (`settings`.`id` = 1)
---
  def update
    @setting = Setting.find(params[:id])