app/controllers/home_controller.rb

SELECT `posts`.slug,`posts`.title,`posts`.id FROM `posts` WHERE (`posts`.`id` = 5) ORDER BY id desc
---
  def index
    set_seo_meta(nil,:keywords => @setting.meta_keywords,:desc => @setting.meta_description)
    set_nav_actived("home")

    # get fanfou messages
    if !@setting.fanfou_id.blank?
      fanfou = Fanfou::FanfouAPI.new
      @fanfou_msgs = Rails.cache.read("data/fanfou/me")
      if @fanfou_msgs.blank?
        @fanfou_result = fanfou.show_user_messages(:id => @setting.fanfou_id)
        @fanfou_xml = ''
        @fanfou_result.each {|l| @fanfou_xml += l}
        @fanfou_msgs = Hash.from_xml(@fanfou_xml)["statuses"]["status"][0..4]
        Rails.cache.write("data/fanfou/me",@fanfou_msgs)
      end
    end

    if !fragment_exist? "home/index/recent_posts"
      @recent_post = Post.find(:first,:order => "created_at desc")

SELECT `pages`.title,`pages`.slug,`pages`.body,`pages`.status,`pages`.created_at,`pages`.updated_at,`pages`.id FROM `pages` WHERE `pages`.id IN ('3')
---
  def show
    @page = Page.find_show(params[:slug])