app/controllers/posts_controller.rb

SELECT `categories`.name,`categories`.slug,`categories`.created_at,`categories`.updated_at,`categories`.posts_count,`categories`.id FROM `categories` WHERE `categories`.id IN ('1')
---
  def index
    if params[:search]
      set_seo_meta("#{params[:search]}的搜索结果")
		elsif params[:category]
			@category = Category.find_by_slug(params[:category])

SELECT `posts`.* FROM `posts` INNER JOIN `categories` ON `categories`.id = `posts`.category_id WHERE (status = 1) ORDER BY id desc LIMIT 0, 5
SELECT count(DISTINCT `posts`.id) AS count_all FROM `posts` LEFT OUTER JOIN `taggings` ON (`posts`.`id` = `taggings`.`taggable_id` AND `taggings`.`taggable_type` = 'Post') LEFT OUTER JOIN `tags` ON (`tags`.`id` = `taggings`.`tag_id`) AND taggings.context = 'tags' INNER JOIN `categories` ON `categories`.id = `posts`.category_id WHERE (status = 1)
---
    if params[:search]
      @cache_key = "posts/index/search/#{params[:search]}/#{page}"
			if !fragment_exist? @cache_key
	      @posts = Post.find_list_with_front(params[:page],per_page,:conditions => ['title like ? or body like ? or meta_keywords like ?',"%#{params[:search]}%","%#{params[:search]}%","%#{params[:search]}%"])

SELECT `tags`.name,`tags`.id FROM `tags` WHERE `tags`.id IN ('5','6')
---
		elsif params[:tag]
			@cache_key = "posts/index/category/#{params[:tag]}/#{page}"
			if !fragment_exist? @cache_key
				@posts = Post.find_list_with_front_by_tag(page,per_page,params[:tag])

UPDATE `posts` SET `comment_count` = 1, `updated_at` = '2010-02-06 05:26:42' WHERE `id` = 7
SELECT `posts`.id FROM `posts` WHERE (LOWER(`posts`.`slug`) = BINARY 'linux-auto-covert-filename-to-lower' AND `posts`.id <> 7) LIMIT 1
INSERT INTO `comments` (`status`, `updated_at`, `referrer`, `body`, `url`, `author`, `post_id`, `user_agent`, `user_ip`, `created_at`, `email`) VALUES(1, '2010-02-06 05:26:42', 'http://127.0.0.1:3000/blog/linux-auto-covert-filename-to-lower', '不是很好，cygwin在windows下安装了以后e检测不到，结果老是提示安装，你会解决么，给我发邮件。谢谢 ', '', '手到拿', 7, 'Mozilla/5.0 (Windows; U; Windows NT 5.2; zh-CN; rv:1.9.0.8) Gecko/2009032609 Firefox/3.0.8 (.NET CLR 3.5.30729) QQDownload/1.7', '127.0.0.1', '2010-02-06 05:26:42', 'lai@gmail.com')
---
  def show
    @post_key = "data/posts/#{params[:slug]}"
    # update pv

    @view_count = Post.update_view_count(params[:slug])

    @post = Rails.cache.read(@post_key)
    if (not @post) or (@view_count == 0)
      @post = Post.find_slug(params[:slug])
      if not @post
        return render_404
      end

      Rails.cache.write(@post_key,@post)
    end

    if request.post?
      @pcomment = params[:comment]
      @comment = Comment.new(params[:comment])

      if captcha_validated?
        @comment.post_id = @post.id
        set_guest(@comment.author,@comment.url,@comment.email)
        if @comment.save

SELECT `comments`.id FROM `comments` WHERE (`comments`.post_id = 7) ORDER BY id ASC
---

    # get comments list
    if !fragment_exist? "posts/show/#{params[:slug]}/comments"
      @comments = @post.comments.find_list