app/controllers/posts_controller.rb

SELECT `categories`.id FROM `categories`
---
  def index
    if params[:category]
			@category = Category.find_by_slug(params[:category])
			if not @category
				render_404
				return
			end

      set_seo_meta("博客 &raquo; 分类：#{@category.name}")
    elsif params[:tag]
      set_seo_meta("博客 &raquo; Tag:#{params[:tag]}")
    else
      set_seo_meta("博客")
    end

    page = params[:page] ? params[:page] : 1
    if params[:category]
			@cache_key = "posts/index/category/#{params[:category]}/#{page}"
			if !fragment_exist? @cache_key
				@posts = @category.posts.paginate :include => [:category],:page => page, :per_page => 5