app/controllers/shares_controller.rb

SELECT * FROM "shares"
---
  def index
    @shares = Share.all